unit kpro;   {Модуль с функциями, необходимыми в программе,
              представляющими собой математические функции}

interface
   type
      TF = function(x:real):real;

   function f112(x:real):real; {производная функции разности 1 и 2 функций}
   function f113(x:real):real; {производная функции разности 3 и 1 функций}
   function f123(x:real):real; {производная функции разности 3 и 2 функций}
   function f12(x:real):real;  {функция разности 1 и 2 функций}
   function f13(x:real):real;  {функция разности 3 и 1 функций}
   function f23(x:real):real;  {функция разности 3 и 2 функций}
   function f2(x: real): real;
   function f1(x: real): real;
   function f3(x: real): real;

implementation
(***************************************************************************)

 function f1(x: real): real;
   begin
     f1:=exp(x*ln(2))+1
   end;

  function f2(x: real): real;
   begin
     if x>0 then
        f2:=exp(5*ln(abs(x)))
     else
        f2:=-exp(5*ln(abs(x)))
   end;

   function f3(x:real):real;
   begin
     f3 := (1-x)/3
   end;

(***************************************************************************)
 function f12(x:real):real;
   begin
      f12:=f1(x)-f2(x)
   end;
(***************************************************************************)

(***************************************************************************)
 function f112(x:real):real;
   begin
    f112:=-5*sqr(sqr(x))+exp(x*ln(2))*ln(2)
   end;
(***************************************************************************)

(***************************************************************************)
 function f13(x:real):real;
   begin
     f13:=f3(x)-f1(x)
   end;
(***************************************************************************)

(***************************************************************************)
 function f113(x:real):real;
   begin
     f113:=-exp(x*ln(2))*ln(2)-1/3
   end;
(***************************************************************************)
 function f23(x:real):real;
   begin
     if abs(x)<0.00000001 then
        f23:=1/3
     else
        f23:=f3(x)-f2(x)
   end;
(***************************************************************************)

(***************************************************************************)
 function f123(x:real):real;
   begin
     f123:= -(1/3) -5*x*x*x*x
   end;
end.
(***************************************************************************)
